Update syntax and formatting
